# vsoStateGetParamChng

## Description
Used to determine if the object parameter has changed. See [[VS:Parametric State Notifications#vsoStateGetParamChng]]

This function should be called during the parametric reset event: <code>3: {kParametricRecalculate}</code>

```pascal
FUNCTION vsoStateGetParamChng(
				hObj          : HANDLE;
				VAR outWidgID : LONGINT;
				VAR outPrmIdx : INTEGER;
				VAR outOldVal : STRING): BOOLEAN;
```

```python
def vs.vsoStateGetParamChng(hObj):
    return (BOOLEAN, outWidgID, outPrmIdx, outOldVal)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hObj|HANDLE|Handle to the parametric object. Obtained by call to GetCustomObjectInfo|
|outWidgID|LONGINT|Output parameter. Widget ID of the changed parameter.|
|outPrmIdx|INTEGER|Output parameter. Parameter index.|
|outOldVal|STRING|Output parameter. String representation of the old value.|

## Remarks
(\_c\_, 2016.05.08): vsoStateGetParamChng returns false after following modifications:
* on PIO rec set up
* on move, rot, path reshape
* layer scale, height, thickness

Thus there won't be a state parameter change on move, rot or on copy.
* outWidgID, outPrmIdx return 0 on move, rot, new obj, alt-drag copy!

Other observations:
* outWidgID:
** returns -1 on editing on drawing a control point
** returns outPrmIdx on any edit in the OIP (including ctrl pt fields)
** returns 0 on edit through a worksheet <--- DON'T USE outWidgID!!!
* outPrmIdx:
** returns outPrmIdx after moving a ctrl pt
** returns outPrmIdx after edit in the OIP
* outOldVal:
** editing dimension or control point parameters: returns a string with the value in mm
** edit after moving a ctrl pt on drawing: returns a string with the values pair in mm
** edit in the OIP: returns a singular value in mm

## Examples
#### VectorScript ####
```pascal
BEGIN
  result := GetCustomObjectInfo(objectName, objectHand, recordHand, wallHand);
  vsoGetEventInfo(theEvent, message );

  CASE theEvent OF
    5: {kObjOnInitXProperties}
    BEGIN
      {enable eventing for this plug-in}
      SetPrefInt( 590, 1 ); {varParametricEnableStateEventing, kParametricStateEvent_ResetStatesEvent}
      result := SetObjPropVS(18, TRUE); {kObjXPropAcceptStates}
    END;

    44: {kObjOnAddState}
    BEGIN
      message := vsoStateAddCurrent( objectHand, message );
    END;

    3: {kParametricRecalculate}
    BEGIN
      MoveTo( 5mm, 8mm );
      CreateText( 'State events received after the last kParametricRecalculate:' );

      IF vsoStateGetParamChng( objectHand, widgID, prmIndex, oldValue ) THEN BEGIN
        MoveTo( 0,-30mm );
        CreateText( Concat( 'Object parameter just changed! widgetID=', widgID, ' paramIndex=', prmIndex,' OldValue=', oldValue ) );
      END;
    END;
```
#### Python ####
```python

```

```pascal
BEGIN {Main}
	IF SetUpObject(parmName, parmHand, parmRecordHand, wallHand, saveClass, noneClass) THEN BEGIN
	    bsb := vsoStateGetParamChng(parmHand, widgetID, index, oldVal);
	    bUseSoundVWPref := GetPref(18);
		IF GetPluginString (3001) <> '' THEN AutoClass (parmHand, GetPluginString (3001));
		bVersion22 := ( p__Version >= 2200 ) | ((p__Version = 0) & (IsNewCustomObject(parmName))) ;

BEGIN
	IF vsoStateGetParamChng( gPluginH, widgetID, parmIdx, oldValue ) THEN
	BEGIN
		paramName := GetFldName( recHand, parmIdx );
		IF paramName = 'OA Height' THEN
		BEGIN
			result := GetObjStoryBound( gPluginH, kTopBoundArchitID, boundType, boundStory, layerLevelType, tempOffset );
			SetObjectStoryBound( gPluginH, kTopBoundArchitID, boundType, boundStory, layerLevelType, tempOffset + ( pOA_Height - ( str2num( oldValue ) * GetPrefReal(152) / 25.4 ) ) );

BEGIN
	Status := vsoStateGetParamChng( pluginH, widgID, outPrmIndx, outOldVal );
	IF ( NOT Status ) THEN
	BEGIN
		SetBubbleBoundsPt;
		GetClosestPolygonPt(hPathObj, bubbleBoundsPt, polyNearestPt);
```
```python
paramChangeFlag, paramChangeWidget, paramChangeIndex, oldParam = vs.vsoStateGetParamChng( gObjHandle );
if paramChangeFlag:
	if ( paramChangeWidget == -1 ) and ( paramChangeIndex == kControlPointMove ):
		vs.SetRField( gObjHandle, gObjName, kNNA_ControlPtsSet, 'True' )
```

## See Also
Parametric State Notifications | vsoStateAddCurrent

vsoStateGetPos | vsoStateGetRot | vsoStateGetParamChng | vsoStateGetObjChng | vsoStateGetLayrChng | vsoStateGetExitGroup | vsoStateGetNameChng

## Version
Availability: from Vectorworks 2009

This is drop-in function.

## Category
* Object Events